# **Домашна работа**


#### **Статичка поделба на работата при креирање софтвер**

Проектен менаџмент: 8,08%

Спецификација на барања: 14,43%

Дизајн: 11,36%

Кодирање/имплементација: 13,50%

SQA (Спроведување на квалитет на софтверот): 30,64%

SCM (управување со ланецот на набавки): 13,02%

Интеграција: 6,54%

Останато: 3%

#### **Развој на софтверот**

[Develoment process](http://www.hostgets.com/images/development_process.gif)

#### **Софтверско инженерство - IEEE**

Примена на систематски и дисциплиниран пристап во развојот, употребата и одржувањето на софтвер, всушност преставува примена на инженерството на софтверот.
Еден од првите и најголемите проекти од софтверко инженерство е креирањето на програмскиот јазик ADA

#### **Основни акривности на софтверското инженерство**

* Дефинирање кој процес на развој на софтвер ќе се користи
* Управување со процесот на развој на софтвер
* Опишување на целниот софтверски продукт
* Дизајнирање на продуктот
* Имплементација на продуктот
* Тестирање на делови од продуктот
* Интегрирање на деловите и нивно тестирање како целина
* Одржување на софтверскиот продукт

#### **Добро креиран софтвер**
* Ја обезбедува бараната функционалност
* Може да се одржува
* Доверлив е
* Ефикасен
* Лесен за употреба
* Економичен

#### **Модели на животен циклус на софтверот**

*Чекорите и фазите низ кои поминува продуктот
* *Фаза на барањата*
* *фаза на спецификации*
* *фаза на дизајнирање*
* *фаза на имплементирање*
* *фаза на интеграција*
* *фаза на одржување*
* *пензионирање или повлекување на продуктот*

#### **Софтверски процеси**
* Креирај и поправи
* Водопад
* Креирање на брз прототип
* Инкрементирачки модел
* Екстермно програмирање
* Синхронизирај и стабилизирај
* Спирален модел
* Објектно-ориентирани модели на животни циклуси
* Споредба на моделите на животни циклуси

### **Заклучоци**
* РАзлични модели
* Сите имаат свои предности и недостатоци
* Како и кој модел ќе го избереме зависи од:
      - Организацијата
      - Нејзиниот менаџмент
      - Знаењата на вработените
      - Природата на самиот проект
* Најдобар пристап е комбинација на сите

#### **Обезбедување на квалитет на софтверот**
* Не постои фаза за обезбедување на квалитет
* Quality Assurance (QA) се извршува во рамките на секоја фаза
* Верификација
     - Се извршува на крајот на секоја фаза
* Валидација
    - Се извршува пред да се испорача продуктот на клиентот
